# Task 2

In [1]:
#biographical film or biopic is a film that dramatizes the life of a non-fictional or historically-based person or people
import pandas as pd
import numpy as np
# Do not alter this line.
biopics = pd.read_csv("C:/Users/Shai/Downloads/biopics.csv", encoding='latin-1')

In [2]:
biopics.head()

,title,country,year_release,box_office,type_of_subject,lead_actor_actress
0,10 Rillington Place,UK,1971,NaN,Criminal,Richard Attenborough
1,12 Years a Slave,US/UK,2013,56700000.0,Other,Chiwetel Ejiofor
2,127 Hours,US/UK,2010,18300000.0,Athlete,James Franco
3,1987,Canada,2014,NaN,Other,Jean-Carl Boucher
4,20 Dates,US,1998,537000.0,Other,Myles Berkowitz

In [3]:
biopics.describe()

       year_release    box_office
count    763.000000  4.390000e+02
mean    1986.971166  2.295256e+07
std       24.020315  3.824200e+07
min     1915.000000  3.150000e+03
25%     1969.000000  1.160000e+06
50%     1995.000000  6.140000e+06
75%     2007.000000  3.050000e+07
max     2014.000000  3.500000e+08

In [4]:
biopics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 763 entries, 0 to 762
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   title               763 non-null    object
 1   country             763 non-null    object
 2   year_release        763 non-null    int64
 3   box_office          439 non-null    float64
 4   type_of_subject     763 non-null    object
 5   lead_actor_actress  756 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 35.9+ KB

In [5]:
biopics.head()

,title,country,year_release,box_office,type_of_subject,lead_actor_actress
0,10 Rillington Place,UK,1971,NaN,Criminal,Richard Attenborough
1,12 Years a Slave,US/UK,2013,56700000.0,Other,Chiwetel Ejiofor
2,127 Hours,US/UK,2010,18300000.0,Athlete,James Franco
3,1987,Canada,2014,NaN,Other,Jean-Carl Boucher
4,20 Dates,US,1998,537000.0,Other,Myles Berkowitz

In [13]:
biopics = biopics.drop_duplicates()
biopics.rename(columns={'box_office': 'earnings'}, inplace=True)
biopics['earnings'] = pd.to_numeric(biopics['earnings'], errors='coerce')
biopics.dropna(subset=['earnings'], inplace=True)
biopics['earnings'].dropna(inplace=True)
biopics = biopics[biopics["year_release"] >= 1990]
biopics['type_of_subject'] = biopics['type_of_subject'].astype('category')
biopics['country'] = biopics['country'].astype('category')
biopics['lead_actor_actress_known'] = biopics['lead_actor_actress'].notna()
biopics = biopics[["title", "year_release", "earnings", "country", "type_of_subject", "lead_actor_actress", "lead_actor_actress_known"]]
#biopics['earnings'] = biopics['earnings'] / 1000000
biopics = biopics.sort_values(by='earnings', ascending=False)

In [14]:
biopics.head()

,title,year_release,earnings,country,type_of_subject,lead_actor_actress,lead_actor_actress_known
38,American Sniper,2014,350000000.0,US,Military,Bradley Cooper,True
547,The Blind Side,2009,256000000.0,US,Athlete,Quinton Aaron,True
334,Lincoln,2012,182000000.0,US,World leader,Daniel Day-Lewis,True
11,A Beautiful Mind,2001,171000000.0,US,Academic,Russell Crowe,True
124,Catch Me If You Can,2002,164000000.0,US/Canada,Criminal,Leonardo DiCaprio,True

In [15]:
biopics_nan= biopics[biopics["earnings"].isna()]
biopics_nan

Empty DataFrame
Columns: [title, year_release, earnings, country, type_of_subject, lead_actor_actress, lead_actor_actress_known]
Index: []

In [16]:
biopics['earnings'].dtype

dtype('float64')

In [17]:
biopics['earnings'].tail()

409    12300.0
624    10400.0
183     5710.0
314     5570.0
485     3270.0
Name: earnings, dtype: float64

In [18]:
biopics["earnings"].isna().sum()

0

In [12]:
biopics['earnings'].unique()

array([3.50e+08, 2.56e+08, 1.82e+08, 1.71e+08, 1.64e+08, 1.63e+08,
       1.39e+08, 1.35e+08, 1.30e+08, 1.26e+08, 1.25e+08, 1.20e+08,
       1.17e+08, 1.16e+08, 1.07e+08, 1.03e+08, 1.01e+08, 9.70e+07,
       9.69e+07, 9.61e+07, 9.50e+07, 9.41e+07, 9.36e+07, 9.11e+07,
       8.49e+07, 8.33e+07, 8.12e+07, 7.56e+07, 7.53e+07, 6.66e+07,
       6.50e+07, 6.44e+07, 6.16e+07, 5.97e+07, 5.82e+07, 5.78e+07,
       5.67e+07, 5.64e+07, 5.29e+07, 5.23e+07, 5.21e+07, 5.17e+07,
       5.07e+07, 5.00e+07, 4.91e+07, 4.88e+07, 4.82e+07, 4.70e+07,
       4.68e+07, 4.39e+07, 4.26e+07, 4.24e+07, 4.20e+07, 4.12e+07,
       3.91e+07, 3.79e+07, 3.77e+07, 3.75e+07, 3.73e+07, 3.68e+07,
       3.66e+07, 3.64e+07, 3.59e+07, 3.54e+07, 3.52e+07, 3.51e+07,
       3.46e+07, 3.45e+07, 3.43e+07, 3.30e+07, 3.25e+07, 3.18e+07,
       3.17e+07, 3.16e+07, 3.10e+07, 3.05e+07, 3.02e+07, 3.00e+07,
       2.98e+07, 2.90e+07, 2.89e+07, 2.87e+07, 2.73e+07, 2.69e+07,
       2.68e+07, 2.58e+07, 2.55e+07, 2.51e+07, 2.50e+07, 2.43e+07,
       2.28e+07, 2.12e+07, 2.11e+07, 2.02e+07, 2.01e+07, 1.96e+07,
       1.87e+07, 1.84e+07, 1.83e+07, 1.76e+07, 1.75e+07, 1.68e+07,
       1.63e+07, 1.61e+07, 1.60e+07, 1.54e+07, 1.52e+07, 1.46e+07,
       1.45e+07, 1.44e+07, 1.42e+07, 1.38e+07, 1.36e+07, 1.34e+07,
       1.33e+07, 1.31e+07, 1.27e+07, 1.24e+07, 1.21e+07, 1.16e+07,
       1.15e+07, 1.10e+07, 1.03e+07, 1.02e+07, 1.01e+07, 9.59e+06,
       9.53e+06, 9.49e+06, 9.26e+06, 9.22e+06, 9.17e+06, 8.60e+06,
       8.32e+06, 8.25e+06, 8.13e+06, 7.56e+06, 7.27e+06, 7.06e+06,
       6.78e+06, 6.62e+06, 6.39e+06, 6.37e+06, 6.20e+06, 6.14e+06,
       6.00e+06, 5.99e+06, 5.89e+06, 5.88e+06, 5.86e+06, 5.70e+06,
       5.67e+06, 5.55e+06, 5.53e+06, 5.48e+06, 5.13e+06, 5.00e+06,
       4.90e+06, 4.87e+06, 4.72e+06, 4.60e+06, 4.53e+06, 4.47e+06,
       4.44e+06, 4.29e+06, 4.23e+06, 4.22e+06, 4.10e+06, 4.08e+06,
       4.07e+06, 4.00e+06, 3.96e+06, 3.90e+06, 3.57e+06, 3.34e+06,
       3.25e+06, 3.24e+06, 3.09e+06, 2.98e+06, 2.96e+06, 2.95e+06,
       2.69e+06, 2.48e+06, 2.47e+06, 2.45e+06, 2.42e+06, 2.39e+06,
       2.23e+06, 2.17e+06, 2.16e+06, 2.14e+06, 2.06e+06, 2.04e+06,
       1.99e+06, 1.94e+06, 1.81e+06, 1.73e+06, 1.72e+06, 1.70e+06,
       1.65e+06, 1.57e+06, 1.45e+06, 1.42e+06, 1.41e+06, 1.30e+06,
       1.23e+06, 1.21e+06, 1.20e+06, 1.19e+06, 1.17e+06, 1.15e+06,
       1.13e+06, 1.12e+06, 1.10e+06, 1.07e+06, 1.04e+06, 1.03e+06,
       1.01e+06, 1.00e+06, 8.72e+05, 7.77e+05, 6.98e+05, 6.93e+05,
       6.71e+05, 6.26e+05, 6.17e+05, 6.16e+05, 5.52e+05, 5.39e+05,
       5.38e+05, 5.37e+05, 5.32e+05, 4.80e+05, 4.55e+05, 4.50e+05,
       4.46e+05, 4.00e+05, 3.65e+05, 3.64e+05, 3.55e+05, 3.53e+05,
       3.43e+05, 3.41e+05, 3.40e+05, 3.32e+05, 3.31e+05, 3.23e+05,
       3.15e+05, 2.97e+05, 2.75e+05, 2.70e+05, 2.26e+05, 2.25e+05,
       2.21e+05, 1.95e+05, 1.54e+05, 1.53e+05, 1.46e+05, 1.44e+05,
       1.37e+05, 1.13e+05, 1.05e+05, 9.88e+04, 8.97e+04, 8.67e+04,
       7.61e+04, 7.49e+04, 6.57e+04, 5.88e+04, 4.95e+04, 4.72e+04,
       4.45e+04, 4.43e+04, 3.66e+04, 2.86e+04, 2.28e+04, 2.18e+04,
       1.93e+04, 1.91e+04, 1.68e+04, 1.28e+04, 1.23e+04, 1.04e+04,
       5.71e+03, 5.57e+03, 3.27e+03,      nan])

Took note of my 2 mistakes .

#1 NaN values drop (The first is the correct one)
biopics.dropna(subset=['earnings'], inplace=True):

This code drops the rows with NaN values from the entire "biopics" dataframe.
The subset=['earnings'] parameter specifies that only the "earnings" column should be considered when dropping the NaN values.
The inplace=True parameter ensures that the changes are applied directly to the "biopics" dataframe.

biopics['earnings'].dropna(inplace=True):

This code drops the NaN values from the "earnings" column itself, without modifying the rest of the dataframe.
The inplace=True parameter ensures that the changes are applied directly to the "earnings" column within the "biopics" dataframe.

#2 biopics['lead_actor_actress_known'] = biopics['lead_actor_actress'].where(biopics['lead_actor_actress'].notna(), False)
the column returns the actual name and then returns only False if its na(), should be

biopics['lead_actor_actress_known'] = biopics['lead_actor_actress'].notna()